Autodesk.Revit.DB.RelatedFileType
Describes the type of related file to be created.
Since:
2014

Autodesk.Revit.DB.RelatedFileType.CloudSharedLocalLink
Creates a new local linked model from the given cloud shared central file.
The new file name is a guid that identifies the central model.

Autodesk.Revit.DB.RelatedFileType.CloudSharedLocal
Creates a new local from the given cloud shared central file.
The new file name is a guid that identifies the central model.

Autodesk.Revit.DB.RelatedFileType.LT
Creates a new central file from the given workshared file.
Appends "LT" to the new file name.

Autodesk.Revit.DB.RelatedFileType.Local
Creates a new local from the given central file.
Appends the username to the new file name.